In [158]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from itertools import combinations 
from collections import Counter

In [75]:
data = pd.read_csv('E:\Programming\Data Science\\movie_bd_v5.csv')
data.sample(5)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year
466,tt1287468,85000000,112483764,Cats & Dogs 2 : The Revenge of Kitty Galore,James Marsden|Nick Nolte|Christina Applegate|B...,Brad Peyton,Just like real spies... only furrier.,The ongoing war between the canine and feline ...,82,Comedy|Family,Village Roadshow Pictures,7/30/2010,5.0,2010
1122,tt0322330,26000000,110230332,Freaky Friday,Jamie Lee Curtis|Lindsay Lohan|Mark Harmon|Har...,Mark Waters,Mondays are manic. Wednesdays are wild. And Fr...,Mother and daughter bicker over everything -- ...,97,Comedy|Family|Fantasy,Walt Disney Pictures,8/3/2003,6.0,2003
1624,tt0358135,50000000,170128460,Shall We Dance?,Richard Gere|Jennifer Lopez|Susan Sarandon|Lis...,Peter Chelsom,Step out of the ordinary,"A romantic comedy where a bored, overworked Es...",107,Drama|Romance|Comedy,Miramax Films,10/15/2004,5.8,2004
260,tt1041829,40000000,317375031,The Proposal,Sandra Bullock|Ryan Reynolds|Mary Steenburgen|...,Anne Fletcher,Here comes the bribe...,When she learns she's in danger of losing her ...,108,Comedy|Romance|Drama,Touchstone Pictures|Mandeville Films|Kurtzman/...,6/1/2009,6.7,2009
366,tt1263670,7000000,39462438,Crazy Heart,Jeff Bridges|Maggie Gyllenhaal|Colin Farrell|R...,Scott Cooper,"The harder the life, the sweeter the song.",When reporter Jean Craddock interviews Bad Bla...,112,Drama|Music|Romance,Fox Searchlight Pictures|Butcher's Run Films|I...,12/16/2009,6.4,2009

In [9]:
data.describe()

             budget       revenue      runtime  vote_average  release_year
count  1.889000e+03  1.889000e+03  1889.000000   1889.000000   1889.000000
mean   5.431083e+07  1.553653e+08   109.658549      6.140762   2007.860773
std    4.858721e+07  2.146698e+08    18.017041      0.764763      4.468841
min    5.000000e+06  2.033165e+06    63.000000      3.300000   2000.000000
25%    2.000000e+07  3.456058e+07    97.000000      5.600000   2004.000000
50%    3.800000e+07  8.361541e+07   107.000000      6.100000   2008.000000
75%    7.200000e+07  1.782626e+08   120.000000      6.600000   2012.000000
max    3.800000e+08  2.781506e+09   214.000000      8.100000   2015.000000

In [335]:
answers = {} # создадим словарь для ответов

# тут другие ваши предобработки колонок например:
data['profit'] = data['revenue']-data['budget']
data['release_month'] = pd.DatetimeIndex(data['release_date']).month

# the function converts separated string to list
def devide_column(str):
    return str.split(sep='|')

# the function counts unique values of the list
def list_elemnts_count(lst):
    c = Counter()
    for x in lst:
        if x == '':
            continue
        c[x] += 1

    return c

# the function makes flat list from list of lists
def numpy_flat(a):
    return list(np.array(a).flat)

# the function recieves source data frame, column name contains separated string and separator
# and returns a new data frame, contains column of spletted values and its count
def column_splitter(src_df, column_of_list, split_str):
    # create a new data frame contains all data from src_df column_of_list
    tmp_df = src_df[column_of_list].str.split(split_str, expand=True)
    # create a new data frame based on flat list of column_of_list
    tmp_df2 = pd.DataFrame(numpy_flat(tmp_df.values.tolist()), columns = [column_of_list])
    # change tmp_df2 with genres and count of movies columns
    tmp_df2 = tmp_df2[column_of_list].value_counts().reset_index()
    tmp_df2.rename(columns={'index':column_of_list,column_of_list:'count'}, inplace=True)
    
    return tmp_df2

#the time given in the dataset is in string format.
#So we need to change this in datetime format
data['release_date'] = data['release_date'].astype('datetime64[ns]')

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit,release_month,genres_list,cast_list
0,tt0369610,150000000,1513528810,Jurassic World,Chris Pratt|Bryce Dallas Howard|Irrfan Khan|Vi...,Colin Trevorrow,The park is open.,Twenty-two years after the events of Jurassic ...,124,Action|Adventure|Science Fiction|Thriller,Universal Studios|Amblin Entertainment|Legenda...,2015-06-09,6.5,2015,1363528810,6,"[Action, Adventure, Science Fiction, Thriller]","[Bryce Dallas Howard, Chris Pratt, Irrfan Khan..."
1,tt1392190,150000000,378436354,Mad Max: Fury Road,Tom Hardy|Charlize Theron|Hugh Keays-Byrne|Nic...,George Miller,What a Lovely Day.,An apocalyptic story set in the furthest reach...,120,Action|Adventure|Science Fiction|Thriller,Village Roadshow Pictures|Kennedy Miller Produ...,2015-05-13,7.1,2015,228436354,5,"[Action, Adventure, Science Fiction, Thriller]","[Charlize Theron, Hugh Keays-Byrne, Josh Helma..."

# Предобработка

Использовать варианты ответов в коде решения запрещено.    
Вы думаете и в жизни у вас будут варианты ответов?)

# 1. У какого фильма из списка самый большой бюджет?

In [12]:
# тут пишем ваш код для решения данного вопроса:
data[data['budget'] == data['budget'].max()][['original_title','imdb_id']]

                                  original_title    imdb_id
723  Pirates of the Caribbean: On Stranger Tides  tt1298650

In [13]:
# в словарь вставляем номер вопроса и ваш ответ на него
# Пример: 
answers['1'] = '2. Spider-Man 3 (tt0413300)'
# запишите свой вариант ответа
answers['1'] = 'Pirates of the Caribbean: On Stranger Tides (tt1298650)'
# если ответили верно, можете добавить комментарий со значком "+"

In [10]:
# можно добавлять разные варианты решения

ВАРИАНТ 2

In [8]:
# думаю логику работы с этим словарем вы уже поняли, 
# по этому не буду больше его дублировать
answers['2'] = 'Gods and Generals (tt0279111)'

# 2. Какой из фильмов самый длительный (в минутах)?

In [14]:
data[data['runtime'] == data['runtime'].max()][['original_title','imdb_id']]

         original_title    imdb_id
1157  Gods and Generals  tt0279111

# 3. Какой из фильмов самый короткий (в минутах)?

In [15]:
answers['3'] = 'Winnie the Pooh (tt1449283)'
data[data['runtime'] == data['runtime'].min()][['original_title','imdb_id']]

      original_title    imdb_id
768  Winnie the Pooh  tt1449283

# 4. Какова средняя длительность фильмов?

In [16]:
answers['4'] = 110

In [17]:
data['runtime'].mean()

109.6585494970884

# 5. Каково медианное значение длительности фильмов?

In [18]:
answers['5'] = 107

In [19]:
data['runtime'].median()

107.0

# 6. Какой самый прибыльный фильм?
#### Внимание! Здесь и далее под «прибылью» или «убытками» понимается разность между сборами и бюджетом фильма. (прибыль = сборы - бюджет) в нашем датасете это будет (profit = revenue - budget)

In [20]:
# лучше код получения столбца profit вынести в Предобработку что в начале
answers['6'] = 'Avatar (tt0499549)'
data[data['profit'] == data['profit'].max()][['original_title','imdb_id']]

    original_title    imdb_id
239         Avatar  tt0499549

# 7. Какой фильм самый убыточный?

In [21]:
answers['7'] = 'The Lone Ranger (tt1210819)'
data[data['profit'] == data['profit'].min()][['original_title','imdb_id']]

       original_title    imdb_id
1245  The Lone Ranger  tt1210819

# 8. У скольких фильмов из датасета объем сборов оказался выше бюджета?

In [22]:
answers['8'] = 1478
len(data[data['profit'] > 0])

1478

# 9. Какой фильм оказался самым кассовым в 2008 году?

In [23]:
answers['9'] = 'The Dark Knight (tt0468569)'
period_filter = data['release_year'] == 2008
profit_max = data[period_filter]['profit'].max()
data[(period_filter)&(data['profit'] == profit_max)][['original_title','imdb_id','profit']]

      original_title    imdb_id     profit
599  The Dark Knight  tt0468569  816921825

# 10. Самый убыточный фильм за период с 2012 по 2014 г. (включительно)?

In [24]:
answers['10'] = 'The Lone Ranger (tt1210819)'
period_filter = (2012<=data['release_year'])&(data['release_year']<=2014)
profit_min = data[period_filter]['profit'].min()
data[(period_filter)&(data['profit'] == profit_min)][['original_title','imdb_id','profit']]

       original_title    imdb_id     profit
1245  The Lone Ranger  tt1210819 -165710090

# 11. Какого жанра фильмов больше всего?

In [245]:
# эту задачу тоже можно решать разными подходами, попробуй реализовать разные варианты
# если будешь добавлять функцию - выноси ее в предобработку что в начале

# add column contains list of values from genres_counts
data['genres_list'] = data['genres'].apply(devide_column)
# create a new data frame contains all data from genres_list column
genres_df = data['genres_list'].apply(pd.Series).fillna('')
# create flat list of genres from genres data frame
genres_list = numpy_flat(genres_df.values.tolist())
# count all elements in genres_list
genres_counts = list_elemnts_count(genres_list)
# sort genres by genre count
sort_genres = sorted(genres_counts.items(), key=lambda x: x[1], reverse=True)
answers['11'] = 'Drama'
sort_genres
#data['genres'].value_counts().sort_values(ascending=False).head(1)

[('Drama', 782),
 ('Comedy', 683),
 ('Thriller', 596),
 ('Action', 582),
 ('Adventure', 415),
 ('Crime', 315),
 ('Romance', 308),
 ('Family', 260),
 ('Science Fiction', 248),
 ('Fantasy', 222),
 ('Horror', 176),
 ('Mystery', 168),
 ('Animation', 139),
 ('Music', 64),
 ('History', 62),
 ('War', 58),
 ('Western', 19),
 ('Documentary', 8),
 ('Foreign', 2)]

ВАРИАНТ 2

In [30]:
# create a new data frame contains separated genres
genres_df = column_splitter(data, 'genres', '|')

display(genres_df.head(3))
answers['11'] = 'Drama'

     genres  count
0     Drama    782
1    Comedy    683
2  Thriller    596

# 12. Фильмы какого жанра чаще всего становятся прибыльными?

In [32]:
# prepare profit filter
filter_profit = data['profit']>0
# create a new data frame contains separated genres
genres_df = column_splitter(data, 'genres', '|')
# retrieve flat list of genres
genres_list = genres_df['genres'].unique()

# run on genres and for each genre calculate count of ther profitable movies
for genre in genres_list:
    # prepare genre filter
    filter_genre = data['genres'].str.contains(genre)
    # calculate count from data
    count = len(data[filter_profit & filter_genre])
    # set profitable value
    genres_df.loc[genres_df['genres']==genre, 'profitable'] = count
    
# retrieve max profitable
display(genres_df[genres_df['profitable'] == genres_df['profitable'].max()])
answers['12'] = 'Drama'

  genres  count  profitable
0  Drama    782       560.0

# 13. У какого режиссера самые большие суммарные кассовые сбооры?

In [33]:
display(data.groupby('director')['revenue'].agg(['sum']).sort_values('sum', ascending=False).head(3))
answers['13'] = 'Peter Jackson'

                          sum
director
Peter Jackson      6490593685
Christopher Nolan  4167548502
David Yates        4154295625

# 14. Какой режисер снял больше всего фильмов в стиле Action?

In [34]:
# create genres filter
director_filter = data['genres'].str.contains('Action', regex=False)
# create a new data frame contains separated directors
director_df = column_splitter(data[director_filter], 'director', '|')

display(director_df.head(3))
answers['14'] = 'Robert Rodriguez'

             director  count
0    Robert Rodriguez      9
1         Michael Bay      7
2  Paul W.S. Anderson      7

# 15. Фильмы с каким актером принесли самые высокие кассовые сборы в 2012 году?

In [35]:
# create a period filter
period_filter = data['release_year']==2012
# create a new data frame contains separated actors
actors_df = column_splitter(data[period_filter], 'cast', '|')
# retrieve actors list
actors_list = actors_df['cast'].unique()

# run on actors and for each actor calculate revenue of their movies
for actor in actors_list:
    # prepare actor filter
    filter_actor = data['cast'].str.contains(actor)
    # calculate revenue from data
    revenue = data[period_filter & filter_actor]['revenue'].sum()
    # set revenue value
    actors_df.loc[actors_df['cast']==actor, 'revenue'] = revenue

display(actors_df.sort_values('revenue', ascending=False).head(3))
answers['15'] = 'Chris Hemsworth'

               cast  count       revenue
4   Chris Hemsworth      4  2.027451e+09
51      Denis Leary      2  1.629461e+09
14    Anne Hathaway      2  1.522851e+09

# 16. Какой актер снялся в большем количестве высокобюджетных фильмов?

In [43]:
# retrive high-budget films
high_budget_films = data[data['budget']>data['budget'].mean()]
# create a new data frame contains separated actors
actors_df = column_splitter(high_budget_films, 'cast', '|')
# retrieve actors list
actors_list = actors_df['cast'].unique()

c = Counter()
# calculate for each actor how much he casts in high-budget films
for actor in actors_list:
    count = len(high_budget_films[high_budget_films['cast'].str.contains(actor)])
    c[actor] += count
    
print(c.most_common(3))
answers['16'] = 'Matt Damon'

[('Matt Damon', 18), ('Adam Sandler', 17), ('Angelina Jolie', 16)]

# 17. В фильмах какого жанра больше всего снимался Nicolas Cage?

In [52]:
# retrieve films with Nicolas Cage
nc_df = data[data['cast'].str.contains('Nicolas Cage')]
# retrieve genres
nc_genres_df = nc_df['genres'].apply(devide_genres).apply(pd.Series).fillna('')
# create flat list of genres from genres data frame
genres_list = numpy_flat(nc_genres_df.values.tolist())
# count all elements in genres_list
genres_counts = list_elemnts_count(genres_list)
display(genres_counts.most_common(3))
answers['17'] = 'Action'

[('Action', 17), ('Thriller', 15), ('Drama', 12)]

# 18. Самый убыточный фильм от Paramount Pictures

In [62]:
# retrieve films of Paramount Pictures
pp_df = data[data['production_companies'].str.contains('Paramount Pictures')]
display(pp_df[pp_df['profit'] == pp_df['profit'].min()][['original_title','imdb_id','profit']])
answers['18'] = 'K-19: The Widowmaker (tt0267626)'

           original_title    imdb_id    profit
925  K-19: The Widowmaker  tt0267626 -64831034

# 19. Какой год стал самым успешным по суммарным кассовым сборам?

In [69]:
display(data.groupby('release_year')['revenue'].agg(['sum']).sort_values('sum', ascending=False).head(3))
answers['19'] = '2015'

                      sum
release_year
2015          25449202382
2014          23405862953
2013          23213799791

# 20. Какой самый прибыльный год для студии Warner Bros?

In [70]:
# retrieve films of Warner Bros
wb_df = data[data['production_companies'].str.contains('Warner Bros')]
display(wb_df.groupby('release_year')['revenue'].agg(['sum']).sort_values('sum', ascending=False).head(3))
answers['20'] = '2014'

                     sum
release_year
2014          3243064519
2007          3183675217
2008          3050595031

# 21. В каком месяце за все годы суммарно вышло больше всего фильмов?

In [82]:
display(data.groupby('release_month')['release_month'].agg(['count']).sort_values('count', =False).head(3))
answers['21'] = 'Сентябрь'

               count
release_month
9                227
12               190
10               186

# 22. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)

In [88]:
period_query = '6 <= release_month <= 8'
display(data.query(period_query)['release_month'].count())
answers['22'] = 450

450

# 23. Для какого режиссера зима – самое продуктивное время года?

In [95]:
# retrieve winter data frame
winter_df = data[data['release_month'].isin([1,2,12])]
# create a new data frame contains separated directors
director_df = column_splitter(data[director_filter], 'director', '|')
# retrieve flat list of directors
directors_list = director_df['director'].unique()

# create counter
c = Counter()
# run on directors and for each director calculate count of ther movies
for d in directors_list:
    c[d] += len(winter_df[winter_df['director'].str.contains(d)])

display(c.most_common(3))
answers['23'] = 'Peter Jackson'

[('Peter Jackson', 7), ('Clint Eastwood', 6), ('Shawn Levy', 4)]

# 24. Какая студия дает самые длинные названия своим фильмам по количеству символов?

In [135]:
# create a new data frame contains separated companies
company_df = column_splitter(data, 'production_companies', '|')
# retrieve flat list of directors
companies_list = company_df['production_companies'].unique()

# calculate mean of title length for each company
c = Counter()

for company in companies_list:
    tmp_df = data[data['production_companies'].str.contains(company)][['production_companies','original_title']]
    length = tmp_df['original_title'].str.len().mean()
    c[company] += length
    
display(c.most_common(3))
answers['24'] = 'Four By Two Productions'

[('Four By Two Productions', 83.0),
 ('Jim Henson Company, The', 59.0),
 ('Dos Corazones', 47.0)]

# 25. Описание фильмов какой студии в среднем самые длинные по количеству слов?

In [137]:
c = Counter()

for company in companies_list:
    tmp_df = data[data['production_companies'].str.contains(company)][['production_companies','overview']]
    length = tmp_df['overview'].str.len().mean()
    c[company] += length
    
display(c.most_common(3))
answers['25'] = 'Midnight Picture Show'

[('Midnight Picture Show', 1000.0),
 ('Room 9 Entertainment', 964.0),
 ('Brookwell-McNamara Entertainment', 936.0)]

# 26. Какие фильмы входят в 1 процент лучших по рейтингу? 
по vote_average

In [156]:
#data frame len
length_df = data['imdb_id'].count()
top_rating_df = data.sort_values(['vote_average'], ascending=False).head(int(length_df/100))
top_rating_df.sort_values(['original_title'], ascending=True).original_title.tolist()
answers['26'] = 'Inside Out, The Dark Knight, 12 Years a Slave '

['12 Years a Slave',
 'Big Hero 6',
 'Gone Girl',
 'Guardians of the Galaxy',
 'Her',
 'Inception',
 'Inside Out',
 'Interstellar',
 'Memento',
 'Room',
 'Spotlight',
 'The Dark Knight',
 'The Fault in Our Stars',
 'The Grand Budapest Hotel',
 'The Imitation Game',
 'The Lord of the Rings: The Return of the King',
 'The Pianist',
 'The Wolf of Wall Street']

# 27. Какие актеры чаще всего снимаются в одном фильме вместе?

In [242]:
'''
Do not run
Very, very slowly!
The second variant is better
'''

# create a new data frame contains separated actors
actors_df = column_splitter(data, 'cast', '|')
# retrieve actors list
actors_list = actors_df['cast'].unique()
# actors count
a_count = len(actors_list)
int_count = 0
for i in range(a_count-1): 
    j = i+1
    if i%10==0:
        print(i,int_count)
    while j < a_count:
        # prepare filter
        count = data[data['cast'].str.contains(actors_list[i]) & data['cast'].str.contains(actors_list[j])]['imdb_id'].count()
        if count > 0:
            c[actors_list[i]+' & '+actors_list[j]] += count
        j += 1
        int_count+=1

display(c.most_common(5))
answers['27'] = 'Daniel Radcliffe & Rupert Grint'

0 0
10 34005
20 67910
30 101715
40 135420
50 169025
60 202530
70 235935
80 269240
90 302445
100 335550
110 368555
120 401460
130 434265
140 466970
150 499575
160 532080
170 564485
180 596790
190 628995
200 661100
210 693105
220 725010
230 756815
240 788520
250 820125
260 851630
270 883035
280 914340
290 945545
300 976650
310 1007655
320 1038560
330 1069365
340 1100070
350 1130675
360 1161180
370 1191585
380 1221890
390 1252095
400 1282200
410 1312205
420 1342110
430 1371915
440 1401620
450 1431225
460 1460730
470 1490135
480 1519440
490 1548645
500 1577750
510 1606755
520 1635660
530 1664465
540 1693170
550 1721775
560 1750280
570 1778685
580 1806990
590 1835195
600 1863300
610 1891305
620 1919210
630 1947015
640 1974720
650 2002325
660 2029830
670 2057235
680 2084540
690 2111745
700 2138850
710 2165855
720 2192760
730 2219565
740 2246270
750 2272875
760 2299380
770 2325785
780 2352090
790 2378295
800 2404400
810 2430405
820 2456310
830 2482115
840 2507820
850 2533425
860 2558930
870 2584335
880 2609640
890 2634845
900 2659950
910 2684955
920 2709860
930 2734665
940 2759370
950 2783975
960 2808480
970 2832885
980 2857190
990 2881395
1000 2905500
1010 2929505
1020 2953410
1030 2977215
1040 3000920
1050 3024525
1060 3048030
1070 3071435
1080 3094740
1090 3117945
1100 3141050
1110 3164055
1120 3186960
1130 3209765
1140 3232470
1150 3255075
1160 3277580
1170 3299985
1180 3322290
1190 3344495
1200 3366600
1210 3388605
1220 3410510
1230 3432315
1240 3454020
1250 3475625
1260 3497130
1270 3518535
1280 3539840
1290 3561045
1300 3582150
1310 3603155
1320 3624060
1330 3644865
1340 3665570
1350 3686175
1360 3706680
1370 3727085
1380 3747390
1390 3767595
1400 3787700
1410 3807705
1420 3827610
1430 3847415
1440 3867120
1450 3886725
1460 3906230
1470 3925635
1480 3944940
1490 3964145
1500 3983250
1510 4002255
1520 4021160
1530 4039965
1540 4058670
1550 4077275
1560 4095780
1570 4114185
1580 4132490
1590 4150695
1600 4168800
1610 4186805
1620 4204710
1630 4222515
1640 4240220
1650 4257825
1660 4275330
1670 4292735
1680 4310040
1690 4327245
1700 4344350
1710 4361355
1720 4378260
1730 4395065
1740 4411770
1750 4428375
1760 4444880
1770 4461285
1780 4477590
1790 4493795
1800 4509900
1810 4525905
1820 4541810
1830 4557615
1840 4573320
1850 4588925
1860 4604430
1870 4619835
1880 4635140
1890 4650345
1900 4665450
1910 4680455
1920 4695360
1930 4710165
1940 4724870
1950 4739475
1960 4753980
1970 4768385
1980 4782690
1990 4796895
2000 4811000
2010 4825005
2020 4838910
2030 4852715
2040 4866420
2050 4880025
2060 4893530
2070 4906935
2080 4920240
2090 4933445
2100 4946550
2110 4959555
2120 4972460
2130 4985265
2140 4997970
2150 5010575
2160 5023080
2170 5035485
2180 5047790
2190 5059995
2200 5072100
2210 5084105
2220 5096010
2230 5107815
2240 5119520
2250 5131125
2260 5142630
2270 5154035
2280 5165340
2290 5176545
2300 5187650
2310 5198655
2320 5209560
2330 5220365
2340 5231070
2350 5241675
2360 5252180
2370 5262585
2380 5272890
2390 5283095
2400 5293200
2410 5303205
2420 5313110
2430 5322915
2440 5332620
2450 5342225
2460 5351730
2470 5361135
2480 5370440
2490 5379645
2500 5388750
2510 5397755
2520 5406660
2530 5415465
2540 5424170
2550 5432775
2560 5441280
2570 5449685
2580 5457990
2590 5466195
2600 5474300
2610 5482305
2620 5490210
2630 5498015
2640 5505720
2650 5513325
2660 5520830
2670 5528235
2680 5535540
2690 5542745
2700 5549850
2710 5556855
2720 5563760
2730 5570565
2740 5577270
2750 5583875
2760 5590380
2770 5596785
2780 5603090
2790 5609295
2800 5615400
2810 5621405
2820 5627310
2830 5633115
2840 5638820
2850 5644425
2860 5649930
2870 5655335
2880 5660640
2890 5665845
2900 5670950
2910 5675955
2920 5680860
2930 5685665
2940 5690370
2950 5694975
2960 5699480
2970 5703885
2980 5708190
2990 5712395
3000 5716500
3010 5720505
3020 5724410
3030 5728215
3040 5731920
3050 5735525
3060 5739030
3070 5742435
3080 5745740
3090 5748945
3100 5752050
3110 5755055
3120 5757960
3130 5760765
3140 5763470
3150 5766075
3160 5768580
3170 5770985
3180 5773290
3190 5775495
3200 5777600
3210 5779605
3220 5781510
3230 5783315
3240 5785020
3250 5786625
3260 5788130
3270 5789535
3280 5790840
3290 5792045
3300 5793150
3310 5794155
3320 5795060
3330 5795865
3340 5796570
3350 5797175
3360 5797680
3370 5798085
3380 5798390
3390 5798595
3400 5798700

[('Emma Watson & Daniel Radcliffe', 8),
 ('Emma Watson & Rupert Grint', 8),
 ('Daniel Radcliffe & Rupert Grint', 8),
 ('Owen Wilson & Ben Stiller', 6),
 ('Johnny Depp & Helena Bonham Carter', 6)]

ВАРИАНТ 2

In [331]:
# create a new column contains list of actors
data['cast_list'] = data.cast.apply(lambda x: x.split('|'))
# retrieve list of actors by movies
list_by_movies = data['cast_list'].values
# make list for all pairs
pairs = []
# for each row retrieve list of actors
for list_actors_in_movie in list_by_movies:
    # sort it to get always equal pairs 
    list_actors_in_movie.sort()
    # create combinations by itertools.combinations
    for p in combinations(list_actors_in_movie, 2):
        pairs.append(' & '.join(str(x) for x in p))
    
# create pairs data frame
pairs_df = pd.DataFrame(pairs, columns=['pairs'])
display(pairs_df.pairs.value_counts().sort_values(ascending=False).head(5))

Emma Watson & Rupert Grint            8
Daniel Radcliffe & Rupert Grint       8
Daniel Radcliffe & Emma Watson        8
Helena Bonham Carter & Johnny Depp    6
Ben Stiller & Owen Wilson             6
Adam Sandler & Kevin James            5
Kristen Stewart & Robert Pattinson    5
Robert Pattinson & Taylor Lautner     5
Kristen Stewart & Taylor Lautner      5
Hugh Jackman & Ian McKellen           5
Name: pairs, dtype: int64

In [332]:
answers['27'] = 'Daniel Radcliffe & Rupert Grint'

# Submission

In [0]:
# в конце можно посмотреть свои ответы к каждому вопросу
answers

{'1': '...', '2': '...'}

In [0]:
# и убедиться что ни чего не пропустил)
len(answers)